code-review/NRB_3471_3546/База_Стало/InformationRegisters/НастройкиРазбораТекстовыхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиРазбораТекстовыхДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>строка полного имени объекта метаданных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/НастройкиРазбораТекстовыхДанных/Ext/ManagerModule.bsl
// Функция - ПроверитьУсловие
//
// Параметры:
//  ДанныеРежимаЗагрузкиОписания				 - 	 Неопределено или Соответствие в случае когда функция вызывается для целей создания описания
//	то есть внесения записей в РС, по блоку условных переходов использующего Объекта														
//  ОбъектНастройки								 - 	 Строка. Полное имя метаданных использующего Объекта 
//  ИмяБлока									 - 	 Строка. Идентификатор блока в использующем Объекте 
//  ИмяВеткиУсловия								 - 	 Строка. Идентификатор ветки условия в отдельном блоке использующего Объекта
//  СтруктураПараметров							 - 	 Структура. Параметры выполнения 
//  ИмеетВложенныеВетвиУсловий					 - 	 Булево.  
//  ТаблицаНастроекРазбораТекстовыхДанныхОбъекта - 	 Таблица значений. Прочитанные записи использующего объекта по блоку
// 
// Возвращаемое значение:
//   - булево. результат проверки по условию, хранящемуся в настройке. Либо в случае режима описания - наличие вложенных условий ЕСЛИ
//
// Функция используется в 2-х режимах работы: режим непосредственного выполнения и режим описания
//
// 		В режиме выполнения при первом входе с конкретными ОбъектНастройки, ИмяБлока и ИмяВеткиУсловия заполляется параметр ТаблицаНастроекРазбораТекстовыхДанныхОбъекта,
// 		который рекомендуется сделать видимым для всего объекта, данными по регистру.
// 		Далее, для входа с любой очередностью по ТаблицаНастроекРазбораТекстовыхДанныхОбъекта ищутся данные для текущих ИмяБлока, ИмяВеткиУсловия, не быть котррых не должно!
// 		по способу хранения настройки в текущей записи определяется способ загрузки и выполнения проверки - основной цели функции
//
// 			Если способ хранения настройки СКД, то при первом входе по конкретному ИмяБлока происходит инициализация  выполнение всех связанных с СКД объектов вплоть до КомпоновщикМакета.Выполнить и сохранение его
//			во временном хранилище. Адрес устанавливается всем строкам в ТаблицаНастроекРазбораТекстовыхДанныхОбъекта по текущему Блоку
//			Далее, при первом (КомпоновщикМакета имеется в контексте) или последующих входах (КомпоновщикМакета загружается из временного хранилища) с одинаковым ИмяБлока и конкретной СтруктураПараметров 
//			в ПроцессорКомпоновки загружается таблица значений с конкретными разбираемыми текстовыми значениями и происходит "выполнение" процессора вывода.
//			таким образом при каждом конкретном вызове с текущим ИмяБлока используется единожды инициализированный и выполненный КомпоновщикМакета, но выполнение процессора вывода
//			происходит с каждым новым значением СтруктураПараметров.
//			
//				При текущем СтруктураПараметров выполнение процессора вывода происходит единожды для всех ИмяВеткиУсловия, а  ВЫПОЛНЕНИЕ ПРОВЕРКИ осуществляется поиском текущего ИмяВеткиУсловия
//				в Таблице значений - результате вывода процессора вывода
//
//			Если способ хранения настройки = текст, то при каждом входе в функцию происходи выполнение выражение сохраненного в текущей настройке (в ресурсе регистра) с переменными из
//			СтруктураПараметров.СтруктураПроверяемыхЗначений
//
//		В режиме описания функция используется при заполненном параметре ДанныеРежимаЗагрузкиОписания (соответствие)
//		Если в ДанныеРежимаЗагрузкиОписания имеются передданные настройки, то они сохраняются в регистре иначе в регистре сохраняется только шаблон (в текстовом виде) предполагаемой настройки
//		с описание доступных переменных
//   - 
//
Функция ПроверкаУсловия(ДанныеРежимаЗагрузкиОписания, ОбъектНастройки, ИмяБлока, ИмяВеткиУсловия, СтруктураПараметров, ИмеетВложенныеВетвиУсловий = Ложь, ТаблицаНастроекРазбораТекстовыхДанныхОбъекта = Неопределено) Экспорт
	
	Перем ДанныеДляРекурсивногоОписания;
	
	СтруктураПроверяемыхЗначений = СтруктураПараметров.СтруктураПроверяемыхЗначений;
	
	Если ТаблицаНастроекРазбораТекстовыхДанныхОбъекта = Неопределено тогда
		//заполняем таблицу единожды, если есть видимость в объекте для неё
		ТаблицаНастроекРазбораТекстовыхДанныхОбъекта = РегистрыСведений.НастройкиРазбораТекстовыхДанных.ДанныеРегистраПоОбъекту(ОбъектНастройки);
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаНастроекРазбораТекстовыхДанныхОбъекта) = Тип("ТаблицаЗначений") Тогда
		ДанныеРегистраПоБлокуИВеткеУсловий = ТаблицаНастроекРазбораТекстовыхДанныхОбъекта.НайтиСтроки(Новый Структура("Блок, Условие", ИмяБлока, ИмяВеткиУсловия));
	Иначе
		ДанныеРегистраПоБлокуИВеткеУсловий = Новый Массив;
	КонецЕсли;
	
	
	Если ДанныеРежимаЗагрузкиОписания = Неопределено Тогда
		
		
		//проверка на существование и корректность ветки
		Если Не ТипЗнч(ДанныеРегистраПоБлокуИВеткеУсловий) = Тип("Массив") Или ДанныеРегистраПоБлокуИВеткеУсловий.Количество() = 0 Тогда
			ВызватьИсключение("Для объекта "+ОбъектНастройки+" для блока "+ИмяБлока+" хватает настройки по Условию '" + ИмяВеткиУсловия + "'");		 
		ИначеЕсли ДанныеРегистраПоБлокуИВеткеУсловий.Количество() > 1 Тогда
			ВызватьИсключение("Для блока "+ИмяБлока+" обнаружено дублирование условий с именем " + ИмяВеткиУсловия +"!"); 
		КонецЕсли;
		
		Если ДанныеРегистраПоБлокуИВеткеУсловий[0].ВидНастройки = 1 Тогда
			
			МакетКомпоновки = Неопределено;		
			
			//извлекаем все ветки условий по блоку
			СтрокиСКДНастроек = ТаблицаНастроекРазбораТекстовыхДанныхОбъекта.Скопировать(Новый Структура("Блок, ВидНастройки", ИмяБлока, 1));
			
 			
			Если Не ЗначениеЗаполнено(ДанныеРегистраПоБлокуИВеткеУсловий[0].АдресДанныхСНастройкамиВСКД) Тогда
				//Получение СКД и прочих связанных объектов единожды для всего блока, 
				//если ТаблицаНастроекРазбораТекстовыхДанныхОбъекта видна во всем объекте				
				
				СКД = РегистрыСведений.НастройкиРазбораТекстовыхДанных.ИнициализироватьНастройкиСКД(СтруктураПроверяемыхЗначений);
					
				//включаем отбор у ИмяВеткиУсловия
				ПолеИмяВеткиУсловия = СКД.НаборыДанных.Получить(0).Поля.Найти("ИмяВеткиУсловия");
				ПолеИмяВеткиУсловия.ОграничениеИспользования.Условие = Ложь;

				
				АдресСхемы = ПоместитьВоВременноеХранилище(СКД);
				КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
				КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
				
				КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
				Настройки = КомпоновщикНастроекКомпоновкиДанных.Настройки;
			
				Для Каждого КиЗ Из СтруктураПроверяемыхЗначений Цикл
					
					//в структуру настроек СКД
					ВыбранноеПолеСКД = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
					ВыбранноеПолеСКД.Использование = Истина;
					ВыбранноеПолеСКД.Поле = Новый ПолеКомпоновкиДанных(КиЗ.Ключ);				
										
				КонецЦикла;
				
				//создаем группу ИЛИ в которую грузим все отборы всех СКД-записей РС по Объекту и блоку
				//попутно отбор каждой записи дополняем группой И в которую включаем текущий отбор и новый элемент, который указываетна имя условия
				
				ГруппаОтбораВерхняя = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбораВерхняя.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
				ГруппаОтбораВерхняя.Использование = Истина;
				КоллекцияЭлементовВерхнейГруппыОтбора = ГруппаОтбораВерхняя.Элементы;
				
				
				//дополняем их отборы
				Для Каждого СтрокаСКДНастройки Из СтрокиСКДНастроек Цикл
					
					СтруктураНастройки = СтрокаСКДНастройки.Настройка.Получить();
					СохраненнаяНастройка = СтруктураНастройки.Данные;
					
					ГруппаОтбора = КоллекцияЭлементовВерхнейГруппыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
					ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
					ГруппаОтбора.Использование = Истина;
					
					КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(ГруппаОтбора, СохраненнаяНастройка.Отбор, Ложь);
					
					ЭлементОтбораВеткаУсловия = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
					ЭлементОтбораВеткаУсловия.Использование = Истина;
					ЭлементОтбораВеткаУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИмяВеткиУсловия");
					ЭлементОтбораВеткаУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементОтбораВеткаУсловия.ПравоеЗначение = СтрокаСКДНастройки.Условие;

					
				КонецЦикла;
				
				КомпоновщикНастроекКомпоновкиДанных.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
				
				КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
				МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроекКомпоновкиДанных.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
				
				АдресДанныхСНастройкамиВСКДПоБлоку = ПоместитьВоВременноеХранилище(МакетКомпоновки);
				
				//сохраняем МакетКомпоновки и проставляем всем строкам объекта данного блока адреса
				Для Каждого Строка Из ТаблицаНастроекРазбораТекстовыхДанныхОбъекта.НайтиСтроки(Новый Структура("Блок", ИмяБлока)) Цикл
					Строка.АдресДанныхСНастройкамиВСКД = АдресДанныхСНастройкамиВСКДПоБлоку;
				КонецЦикла;		
				
			КонецЕсли;	
				
			
			//выполним компоновку результата при первом входе в функцию по данному блоку в конкретном вызове (физически уникальная СтруктураПараметров)
			Если Не СтруктураПараметров.Свойство("РезультатФормированияСКД") Тогда
				
				Если МакетКомпоновки = Неопределено Тогда
					МакетКомпоновки = ПолучитьИзВременногоХранилища(ДанныеРегистраПоБлокуИВеткеУсловий[0].АдресДанныхСНастройкамиВСКД);					
				КонецЕсли;
				
				
				ВнешнийНаборДанных = Новый ТаблицаЗначений;
				ВнешнийНаборДанных.Колонки.Добавить("ИмяВеткиУсловия", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(200)));
				
				Для Каждого СтрокаДанныхРегистраПоБлоку Из СтрокиСКДНастроек Цикл
				
					НС = ВнешнийНаборДанных.Добавить();
					НС.ИмяВеткиУсловия = СтрокаДанныхРегистраПоБлоку.Условие;
				
				КонецЦикла;	
				
				Для Каждого КиЗ Из СтруктураПроверяемыхЗначений Цикл			
					
					ВнешнийНаборДанных.Колонки.Добавить(КиЗ.Ключ, Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1000)));
					ВнешнийНаборДанных.ЗаполнитьЗначения(КиЗ.Значение, КиЗ.Ключ);
					
					Если СтрДлина(КиЗ.Значение) > 1000 Тогда
						Сообщить("Длина текста, подлежащего разбору превышает 1000 символов! В этом случае текст усекается до 1000 и могут быть потеряны ключевые фрагменты. " +Символы.ПС + 
						"рекомендуется изменить настройку по Блоку " + ИмяБлока + " на текстовое описание настройки!");
					КонецЕсли;					
					
				КонецЦикла;
				
				//выполнение
				ДанныеРасшифровки = неопределено;
				ВнешниеНаборыДанных = Новый Структура;
				ВнешниеНаборыДанных.Вставить("ВнешнийНаборДанных", ВнешнийНаборДанных);
				
				
				ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
				ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
				
				РезультатФормированияСКД = Новый ТаблицаЗначений;
				
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
				ПроцессорВывода.УстановитьОбъект(РезультатФормированияСКД);
				ПроцессорВывода.Вывести(ПроцессорКомпоновки);

				
		        СтруктураПараметров.Вставить("РезультатФормированияСКД", РезультатФормированияСКД);				
								
			КонецЕсли;
			
			
			//проверка выполнения условия
			Возврат СтруктураПараметров.РезультатФормированияСКД.Найти(ИмяВеткиУсловия, "ИмяВеткиУсловия") <> Неопределено;
			
		Иначе	
			
			//проверка выполнения условия
					
			Ощибка = "";
			Попытка
				Результат = Вычислить(ДанныеРегистраПоБлокуИВеткеУсловий[0].Настройка.Получить().Данные);
			Исключение
				Ощибка = ОписаниеОшибки();
			КонецПопытки;
			
			Если Не ТипЗнч(Результат) = Тип("Булево") Тогда
				ВызватьИсключение("Для объекта "+ОбъектНастройки+" для блока "+ИмяБлока+" результат вычисления текстового выражения не имеет булевой тип! " + ?(Ощибка = "", "", Ощибка));
			КонецЕсли;
			Возврат Результат;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	
	//заполение Регистра в режиме описания		
	Если ДанныеРежимаЗагрузкиОписания <> Неопределено Тогда
		//условие не выполняется, т.к. цель - внести настройку в РС
		
		МЗ = РегистрыСведений.НастройкиРазбораТекстовыхДанных.СоздатьМенеджерЗаписи();
		МЗ.Объект = ОбъектНастройки;
		МЗ.Блок = ИмяБлока;
		МЗ.Условие = ИмяВеткиУсловия;
		
		НастройкаЗадана = Ложь;
		Если ТипЗнч(ДанныеРежимаЗагрузкиОписания) = Тип("Соответствие") Тогда 
			ОписаниеУсловийБлока = ДанныеРежимаЗагрузкиОписания.Получить(ИмяБлока);
			Если ОписаниеУсловийБлока <> Неопределено Тогда
				ДанныеРежимаЗагрузкиОписанияПоВеткеУсловий = ОписаниеУсловийБлока.Получить(ИмяВеткиУсловия);
				Если ДанныеРежимаЗагрузкиОписанияПоВеткеУсловий <> Неопределено Тогда
					МЗ.Настройка = Новый ХранилищеЗначения(ДанныеРежимаЗагрузкиОписанияПоВеткеУсловий);
					МЗ.ВидНастройки = ДанныеРежимаЗагрузкиОписанияПоВеткеУсловий.ВидНастройки;
					НастройкаЗадана = Истина;
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
		
		//изначально простой вариант - текст
		Если Не НастройкаЗадана Тогда			
			
			Шаблон = "// Доступные переменные:" + Символы.ПС;
			Для Каждого КиЗ Из СтруктураПроверяемыхЗначений Цикл
				Шаблон = Шаблон + "//СтруктураПроверяемыхЗначений[""" + КиЗ.Ключ + """]" + Символы.ПС;
			КонецЦикла;
						
			Настройка = Новый Структура("Данные, ДоступныеПеременные", Шаблон, СтруктураПроверяемыхЗначений);
			МЗ.Настройка = Новый ХранилищеЗначения(Настройка);
			МЗ.ВидНастройки = 0;			
			
		КонецЕсли;
		 		       	
		
		Если ИмеетВложенныеВетвиУсловий Тогда
			
			//для случая когда в одной из ветвей "иначеЕсли" есть вложенный блок "Если" нужно
			//пройтись и описать, соответственно, это вложенный блок (и следующий и т.д.)
			//тогда в верхнем проходе по веткам можно не попасть в следующие "иначеЕсли" или" Иначе"
			//для этого запоминаем ветку на которой было как бы выполнение (возврат Истина)
			//чтобы при повторном вызове (должно быть обеспечено до входа в функцию) просто пройти 
			//дальше на следующие ветки верхнего блока "если"
			
			
			Если Не СтруктураПараметров.Свойство("ДанныеДляРекурсивногоОписания", ДанныеДляРекурсивногоОписания) тогда
				ДанныеДляРекурсивногоОписания = Новый Массив;
				СтруктураПараметров.Вставить("ДанныеДляРекурсивногоОписания", ДанныеДляРекурсивногоОписания);
			КонецЕсли;
			
			Количество = ДанныеДляРекурсивногоОписания.Количество();
			Если Количество > 0 И ДанныеДляРекурсивногоОписания[Количество - 1] = ИмяВеткиУсловия Тогда
				
				//последний по "стеку"
				ДанныеДляРекурсивногоОписания.Удалить(Количество - 1);
				
				Если ДанныеДляРекурсивногоОписания.Количество() = 0 Тогда
					СтруктураПараметров.Удалить("ДанныеДляРекурсивногоОписания");
				КонецЕсли;			
				
				Возврат Ложь;
			Иначе
				ДанныеДляРекурсивногоОписания.Добавить(ИмяВеткиУсловия);
			КонецЕсли; 			
			
		КонецЕсли;
		
		Если ДанныеРегистраПоБлокуИВеткеУсловий.Количество() = 0 Или НастройкаЗадана Тогда
			МЗ.Записать();
		КонецЕсли;
		
		
		Возврат ИмеетВложенныеВетвиУсловий;
		
	КонецЕсли;	
		
КонецФункции

// Функция - Данные регистра по объекту
//
// Параметры:
//  ОбъектНастройки	 - 	Строка. имя объекта
// 
// Возвращаемое значение:
//   - 
//
функция ДанныеРегистраПоОбъекту(ОбъектНастройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	НастройкиРазбораТекстовыхДанных.Блок КАК Блок,
	|	НастройкиРазбораТекстовыхДанных.Условие КАК Условие,
	|	НастройкиРазбораТекстовыхДанных.Настройка КАК Настройка,
	|	НастройкиРазбораТекстовыхДанных.ВидНастройки КАК ВидНастройки
	|ИЗ
	|	РегистрСведений.НастройкиРазбораТекстовыхДанных КАК НастройкиРазбораТекстовыхДанных
	|ГДЕ
	|	НастройкиРазбораТекстовыхДанных.Объект = &Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Блок";
	
	Запрос.УстановитьПараметр("Объект", ОбъектНастройки);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Индексы.Добавить("Блок, Условие");
	
	Таблица.Колонки.Добавить("АдресДанныхСНастройкамиВСКД", Новый ОписаниеТипов("Строка"));
	
	Возврат Таблица;
	
		
КонецФункции

// Функция - Объекты использующие регистр
// 
// Возвращаемое значение:
//   - СписокЗначений. Список имен объектов использующих функционал
//
Функция ОбъектыИспользующиеРегистр() Экспорт
	
	Список = Новый СписокЗначений;
	//1.
	МД = Метаданные.Обработки.ЗагрузкаДокументовИзНРД;
	Список.Добавить(МД.ПолноеИмя(), МД.Синоним);
	
	//...
		
	Возврат Список;
	
КонецФункции

// Функция - Инициализировать настройки СКД
//
// Параметры:
//  ПроверяемыеЗначения	 - 	Структура. Ключи - имена полей
// 
// Возвращаемое значение:
//   - Схема компоновки данных. СКД с динамически заполненными полями набора
//
Функция ИнициализироватьНастройкиСКД(ПроверяемыеЗначения) Экспорт
	
	СКД = РегистрыСведений.НастройкиРазбораТекстовыхДанных.ПолучитьМакет("СКД");
	НаборДанныхСКД = СКД.НаборыДанных.Получить(0);
	
	Для Каждого КиЗ Из ПроверяемыеЗначения Цикл
		//добавление в поля ключей структуры элементов проверяемых значений		
		НовоеПолеНабора = НаборДанныхСКД.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПолеНабора.Поле = КиЗ.Ключ;
		НовоеПолеНабора.ПутьКДанным = КиЗ.Ключ;
		НовоеПолеНабора.Заголовок = КиЗ.Ключ;
		
		НовоеПолеНабора.ТипЗначения = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1000));
	КонецЦикла;
	
	Возврат СКД;	
		
КонецФункции

Процедура УстановитьДоступныеПеременныеВеткамУсловий(ДанныеРежимаЗагрузкиОписания, СтруктураПроверяемыхЗначений, ИмяБлока) Экспорт
	
	Если ТипЗнч(ДанныеРежимаЗагрузкиОписания) = Тип("Соответствие") Тогда
		СоответствияВетокУсловий = ДанныеРежимаЗагрузкиОписания.Получить(ИмяБлока);
		Если ТипЗнч(СоответствияВетокУсловий) = Тип("Соответствие") Тогда  
			Для Каждого ВеткаУсловий Из СоответствияВетокУсловий Цикл
				ВеткаУсловий.Значение.Вставить("ДоступныеПеременные", СтруктураПроверяемыхЗначений);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Создать заполнение на основе шаблона
//
// Параметры:
//  ИмяОбъектаМетаданных		 - Строка. Имя объекта	  
//  ДанныеРежимаЗагрузкиОписания - 	 Соответствие. Описание типовых настроек, заданных ранее 
//
Процедура СоздатьЗаполнениеНаОсновеШаблона(ИмяОбъектаМетаданных, ДанныеРежимаЗагрузкиОписания = Неопределено) Экспорт
	
	Перем Объект;
	Перем ОписаниеБлоков;
	
	ДанныеРежимаЗагрузкиОписания = ?(ДанныеРежимаЗагрузкиОписания = Неопределено, Новый Соответствие, ДанныеРежимаЗагрузкиОписания);
	
	Если Найти(ИмяОбъектаМетаданных, "ОбщийМодуль.") > 0 Тогда
		Менеджер = Вычислить(СтрЗаменить(ИмяОбъектаМетаданных, "ОбщийМодуль.", ""));
	Иначе
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяОбъектаМетаданных);		
	КонецЕсли;
	СтруктураОписания = Менеджер.ДанныеОписанийУсловийПереходаПоРазборуТекста();
	
	
	//общая проверка необходимых свойств
	Ошибка = Ложь;
	Если Не СтруктураОписания.Свойство("Объект", Объект) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не верно описано заполнение в функции 'ДанныеОписанийУсловийПереходаПоРазборуТекста' для "+ИмяОбъектаМетаданных+": не указано свойство 'Объект'", Ошибка);
	КонецЕсли;
	Если Не СтруктураОписания.Свойство("ОписаниеБлоков", ОписаниеБлоков) Или Не ТипЗнч(ОписаниеБлоков) = Тип("Массив") Или ОписаниеБлоков.Количество()= 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не верно описано заполнение в функции 'ДанныеОписанийУсловийПереходаПоРазборуТекста' для "+ИмяОбъектаМетаданных+": не указано или неверно заполнено свойство 'ОписаниеБлоков'", Ошибка);		
	КонецЕсли;
	
	Если ТипЗнч(ОписаниеБлоков) = Тип("Массив") Тогда
		Для Каждого ОписаниеБлока Из ОписаниеБлоков Цикл
			Если ТипЗнч(ОписаниеБлока) <> Тип("Структура") Или Не ОписаниеБлока.Свойство("ИмяБлока") Или Не ОписаниеБлока.Свойство("СтруктураПроверяемыхЗначений") Или Не ОписаниеБлока.Свойство("ПроцедураЗаполненияБлока") Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не верно описано заполнение в функции 'ДанныеОписанийУсловийПереходаПоРазборуТекста' для "+ИмяОбъектаМетаданных+": не верно описано заполнение блоков", Ошибка);		
				Прервать;
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
	Если Ошибка Тогда
		Возврат;
	КонецЕсли;
	
	//создание описаний блоков (выполнение функций ПроцедураЗаполненияБлока)
	Для Каждого ОписаниеБлока Из ОписаниеБлоков Цикл
		
		УстановитьДоступныеПеременныеВеткамУсловий(ДанныеРежимаЗагрузкиОписания, ОписаниеБлока.СтруктураПроверяемыхЗначений, ОписаниеБлока.ИмяБлока);
		
		Выполнить(ОписаниеБлока.ПроцедураЗаполненияБлока + "(ОписаниеБлока, ДанныеРежимаЗагрузкиОписания)");
		
	КонецЦикла;	

	
КонецПроцедуры

Процедура ВыполнитьТиповоеЗаполнение(ИмяОбъектаМетаданных) Экспорт
	
	Перем Объект;
	Перем ОписаниеБлоков;
	
	Если Найти(ИмяОбъектаМетаданных, "ОбщийМодуль.") > 0 Тогда
		Менеджер = Вычислить(СтрЗаменить(ИмяОбъектаМетаданных, "ОбщийМодуль.", ""));
	Иначе
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяОбъектаМетаданных);		
	КонецЕсли;

	Попытка
		ДанныеТиповогоЗаполнения = Менеджер.ДанныеТиповогоЗаполненияБлоковОбъекта();
	Исключение
		Сообщить("процедура типового заполнения объекта " + ИмяОбъектаМетаданных + " не описана!");
		Возврат;
	КонецПопытки;
	
	
	Если ТипЗнч(ДанныеТиповогоЗаполнения) = Тип("Соответствие") тогда
		СоздатьЗаполнениеНаОсновеШаблона(ИмяОбъектаМетаданных, ДанныеТиповогоЗаполнения);
	Иначе
		Сообщить("Не заданы типовые настройки для объекта");
	КонецЕсли;		
	
КонецПроцедуры

Функция ПолучитьУсловияРазбораТекста(ОбъектМетаданных, ИмяБлока) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиРазбораТекстовыхДанных.Условие КАК Условие
	|ИЗ
	|	РегистрСведений.НастройкиРазбораТекстовыхДанных КАК НастройкиРазбораТекстовыхДанных
	|ГДЕ
	|	НастройкиРазбораТекстовыхДанных.Объект = &Объект
	|	И НастройкиРазбораТекстовыхДанных.Блок = &Блок");
	Запрос.УстановитьПараметр("Объект", ОбъектМетаданных);
	Запрос.УстановитьПараметр("Блок", ИмяБлока);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
